[
"हर रोज, रोज डे आये,\nइस बहाने तू मेरे लिए गुलाब लाये!!", 
"“कोई फर्क नहीं होता है ज़हर और प्यार में\nज़हर पीने के बाद लोग मर जाते हैं,\nऔर प्यार करने के बाद लोग जी नहीं पाते हैं।”\nहैप्पी रोज डे ।", 
"हर फुल की अजब कहानी हैं।\nचुप रहना भी एक प्यार निशानी हैं।\nकही कोई जख्म तो नहीं फिर भी क्यो यह यहसास हैं।\nलगता हैं दिल का एक टुकडा आज भी उसके पास हैं।\nरोज डे मुबारक हो।", 
"बीते साल के बाद फिर से रोज डे आया हैं,\nमेरी आँखों में सिर्फ तेरा ही सुरूर छाया हैं,\nजरा तुम आकर तो देखो एक बार,\nतुम्हारे इंतजार में पुरे घर को सजाया हैं!!", 
"बड़े ही चुपके से भेजा था,\nमेरे महबूब ने मुझे एक गुलाब,\nकम्बख्त उसकी खुशबू ने,\nसारे शहर में हंगामा कर दिया!!", 
"जिसे पाया ना जा सके वो जनाब हो तुम,\nमेरी जिंदगी का पहला ख्वाब हो तुम,\nलोग चाहे कुछ भी कहे लेकिन,\nमेरी ज़िन्दगी का एक सुन्दर सा गुलाब हो तुम!!", 
"ज़िन्दगी की हर सुबह कुछ शर्तें लेकर आती है,\nऔर ज़िन्दगी की हर शाम कुछ\nतज़ुर्बे देकर जाती है।” हैप्पी रोज डे ।", 
"जो आसानी से मिले वो है धोखा,\nजो-मुश्किल से मिले वो है इज्जत,\nजो दिल से मिले वो है प्यार,\nऔर जो नसीब से मिले वो है आप,\nहेप्पी रोज डे", 
"आप मिलते नही Roz Roz,\nआपकी याद आती है हर Roz,\nहमने भेजा है Red Roz,\nजो आपको हमारी याद दिलायेगा हर Roz!!", 
"“तलाश करो कोई तुम्हे मिल जाएगा मगर हमारी\nतरह तुम्हे कौन चाहेगा ज़रूर कोई चाहत की\nनज़र से तुम्हें देखेगा मगर आँखें\nहमारी कहाँ से लाएगा।” हैप्पी रोज डे ।", 
"कोई फर्क नहीं होता जहर और प्यार में,\nजहर पिने के बाद लोग मर जाते हैं,\nऔर प्यार करने के बाद लोग जि नहीं पाते हैं,\nहेप्पी रोज डे", 
"आप मिलते नही Roj Roj,\nआपकी याद आती है हर Roj,\nहमने भेजा है Red Rose,\nजो आपको हमारी याद दिलायेगा हर Roj,\nहेप्पी रोज़ डे, रोज़ डे मुबारक हो।", 
"अगर कुछ बनना है तो,\nगुलाब के फुल बनो,\nक्योंकी ये फुल उस के,\nहाथ मैं भी खुशबु छोड़ देता है,\nजो इसे मसल कर फ़ेंक देता है!!", 
"“आज से पावन वैलेंटाइन्स सप्ताह की शुरुआत हो चुकी है,\nसभी श्रद्धालु लड़के ग़ुलाब के फ़ूलो का,\nसुंदर लड़कियो को चाकॅलेट के साथ दान दें,\nकृपा आएगी!” हैप्पी रोज डे ।", 
"“आज से पावन वैलेंटाइन्स सप्ताह की शुरुआत हो चुकी है,\nसभी श्रद्धालु लड़के ग़ुलाब के फ़ूलो का,\nसुंदर लड़कियो को चाकॅलेट के साथ दान दें,\nकृपा आएगी!” हैप्पी रोज डे ।", 
"मेरी दिवानगी कि कोई हद नहीं,\nतेरी सुरत के सिवा मुझे कुछ याद नहीं,\nमैं गुलाब हू तेरे गुलशन का,\nतेरे सिवाए मुझ पर किसी का हक नहीं,\nहेप्पी रोज डे", 
"बडे ही चुपके से भेजा मेरे\nमहेबूब ने मुझे एक गुलाब,\nकमबख्त उसकी खुश्बू ने\nसारे शहर में हंगामा कर दिया।", 
"चाहे उनसे कितना भी झगड़ा क्यों ना हुआ हो,\nलेकिन उसका एक SMS आते ही,\nसाला Dil Garden Garden हो जाता है!!", 
"जिते है तेरा नाम लेकर मरने\nके बाद क्या अंजाम होगा।\nकफन उठा के देख लेना\nमेरा हाथो पे तेरा ही नाम होगा।\nरोज डे मुबारक हो।", 
"\nदिखती हैं हीर की तरह,\nलगती हैं खीर की तरह,\nदिल में चुभती हैं तीर की तरह,\nऔर छोड़ जाती हैं फकीर की तरह…", 
"\nबड़े ही चुपके से भेजा था,\nमेरे महबूब ने मुझे एक गुलाब,\nकम्बख्त उसकी खुशबू ने,\nसारे शहर में हंगामा कर दिया!!", 
"\nबड़े ही चुपके से भेजा था,\nमेरे महबूब ने मुझे एक गुलाब,\nकम्बख्त उसकी खुशबू ने,\nसारे शहर में हंगामा कर दिया!!", 
"जिंदगी की हर सुबह कुछ शतें लेकर आती है।\nऔर जिंदगी की हर शाम कुछ तजुबें देकर जाती हैं।\nरोज डे मुबारक हो", 
"प्यार के समंदर में सब डूबना चाहते है,\nप्यार में कुछ खोते है तो कुछ पाते है,\nप्यार तो एक गुलाब है, जिसे लोग तोड़ना चाहते है,\nहम इस गुलाब को सिर्फ चूमना चाहते है…."
]